region = "ap-northeast-1"
access_key = "##############"
secret_key = "##############"
name = "test"

#--------------------------------------------------------------
# VPC
#--------------------------------------------------------------
vpc_cidr             = "10.0.0.0/16"
azs                  = ["ap-northeast-1a", "ap-northeast-1c"]   #["ap-northeast-1a", "ap-northeast-1c"]のように配列で複数指定可能
public_subnet_cidrs  = ["10.0.0.0/24"]                          #["10.0.0.0/24", "10.0.1.0/24"]のように配列で複数指定可能
private_subnet_cidrs = ["10.0.1.0/24", "10.0.2.0/24"]           #["10.0.2.0/24", "10.0.3.0/24"]のように配列で複数指定可能

#--------------------------------------------------------------
# EC2
#--------------------------------------------------------------
instance_type = "t2.micro"

#--------------------------------------------------------------
# RDS
#--------------------------------------------------------------
db_name     = "testdb"
db_username = "admin"
engine = "mysql"
engine_version = "8.0.28"
db_instance = "db.t2.micro"
